# IsValidMinorLapSplice Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..IsValidMinorLapSplice Method
FabricSheetType Class See Also
---
Identifies if the input value is valid to be applied as the minor lap splice value for this FabricSheetType.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsValidMinorLapSplice(
	double minorLapSplice
)
```

Visual Basic
---
```text
Public Function IsValidMinorLapSplice ( _
	minorLapSplice As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidMinorLapSplice(
	double minorLapSplice
)
```

# ### Parameters
minorLapSplice
    Type: System..::..Double
# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace